Revit 2027 API
ColorFillScheme.IsEntryConsistentWithScheme Method
 Checks whether an entry can be added to the scheme or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EntryAndSchemeConsistency IsEntryConsistentWithScheme(
	ColorFillSchemeEntry entry
)
Public Function IsEntryConsistentWithScheme (
	entry As ColorFillSchemeEntry
) As EntryAndSchemeConsistency
public:
EntryAndSchemeConsistency IsEntryConsistentWithScheme(
	ColorFillSchemeEntry^ entry
)
member IsEntryConsistentWithScheme :
        entry : ColorFillSchemeEntry -> EntryAndSchemeConsistency
Parameters
entry ColorFillSchemeEntry
 The entry to check.
Return Value
EntryAndSchemeConsistency
 The state of entry and scheme consistency.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace